## Plan Result (prod_global)




<pre><code>Plan: 4 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;build&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;child-adoption&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;static-build&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;child-adoption&#34;]
* Update
  * module.landing_zone[0].azurerm_frontdoor.main
  * module.landing_zone[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone[0].azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod"
        name                                 = "hmcts-prod"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-private-law" -> "healthProbeSettings-child-adoption"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/private-law"
          ~ load_balancing_name = "loadBalancingSettings-private-law" -> "loadBalancingSettings-child-adoption"
          ~ name                = "private-law" -> "child-adoption"

          ~ backend {
              ~ host_header = "www.apply-to-court-about-child-arrangements-c100.service.gov.uk" -> "www.apply-to-adopt-a-child-placed-in-your-care.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-et-sya" -> "healthProbeSettings-private-law"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/et-sya"
          ~ load_balancing_name = "loadBalancingSettings-et-sya" -> "loadBalancingSettings-private-law"
          ~ name                = "et-sya" -> "private-law"

          ~ backend {
              ~ host_header = "www.claim-employment-tribunals.service.gov.uk" -> "www.apply-to-court-about-child-arrangements-c100.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sptribs-frontend" -> "healthProbeSettings-et-sya"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/sptribs-frontend"
          ~ load_balancing_name = "loadBalancingSettings-sptribs-frontend" -> "loadBalancingSettings-et-sya"
          ~ name                = "sptribs-frontend" -> "et-sya"

          ~ backend {
              ~ host_header = "www.special-tribunals.service.gov.uk" -> "www.claim-employment-tribunals.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-dtsse-ardoq-adapter" -> "healthProbeSettings-sptribs-frontend"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/dtsse-ardoq-adapter"
          ~ load_balancing_name = "loadBalancingSettings-dtsse-ardoq-adapter" -> "loadBalancingSettings-sptribs-frontend"
          ~ name                = "dtsse-ardoq-adapter" -> "sptribs-frontend"

          ~ backend {
              ~ host_header = "dtsse-ardoq-adapter.platform.hmcts.net" -> "www.special-tribunals.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-et-pet" -> "healthProbeSettings-dtsse-ardoq-adapter"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/et-pet"
          ~ load_balancing_name = "loadBalancingSettings-et-pet" -> "loadBalancingSettings-dtsse-ardoq-adapter"
          ~ name                = "et-pet" -> "dtsse-ardoq-adapter"

          ~ backend {
              ~ host_header = "employmenttribunals.service.gov.uk" -> "dtsse-ardoq-adapter.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-et-staff-pet" -> "healthProbeSettings-et-pet"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/et-staff-pet"
          ~ load_balancing_name = "loadBalancingSettings-et-staff-pet" -> "loadBalancingSettings-et-pet"
          ~ name                = "et-staff-pet" -> "et-pet"

          ~ backend {
              ~ host_header = "admin.employmenttribunals.service.gov.uk" -> "employmenttribunals.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-et-response-pet" -> "healthProbeSettings-et-staff-pet"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/et-response-pet"
          ~ load_balancing_name = "loadBalancingSettings-et-response-pet" -> "loadBalancingSettings-et-staff-pet"
          ~ name                = "et-response-pet" -> "et-staff-pet"

          ~ backend {
              ~ host_header = "tribunal-response.employmenttribunals.service.gov.uk" -> "admin.employmenttribunals.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-tt-pet" -> "healthProbeSettings-et-response-pet"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/tt-pet"
          ~ load_balancing_name = "loadBalancingSettings-tt-pet" -> "loadBalancingSettings-et-response-pet"
          ~ name                = "tt-pet" -> "et-response-pet"

          ~ backend {
              ~ host_header = "appeal-tax-tribunal.service.gov.uk" -> "tribunal-response.employmenttribunals.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-hwf-staff-pet" -> "healthProbeSettings-tt-pet"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/hwf-staff-pet"
          ~ load_balancing_name = "loadBalancingSettings-hwf-staff-pet" -> "loadBalancingSettings-tt-pet"
          ~ name                = "hwf-staff-pet" -> "tt-pet"

          ~ backend {
              ~ host_header = "staff.helpwithcourtfees.service.gov.uk" -> "appeal-tax-tribunal.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-hwf-pet" -> "healthProbeSettings-hwf-staff-pet"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/hwf-pet"
          ~ load_balancing_name = "loadBalancingSettings-hwf-pet" -> "loadBalancingSettings-hwf-staff-pet"
          ~ name                = "hwf-pet" -> "hwf-staff-pet"

          ~ backend {
              ~ host_header = "helpwithcourtfees.service.gov.uk" -> "staff.helpwithcourtfees.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-hwf-pet"
          + load_balancing_name = "loadBalancingSettings-hwf-pet"
          + name                = "hwf-pet"

          + backend {
              + address     = "firewall-prod-int-palo-cftprod.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "helpwithcourtfees.service.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-private-law"
          ~ name                = "healthProbeSettings-private-law" -> "healthProbeSettings-child-adoption"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-et-sya"
          ~ name                = "healthProbeSettings-et-sya" -> "healthProbeSettings-private-law"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-sptribs-frontend"
          ~ name                = "healthProbeSettings-sptribs-frontend" -> "healthProbeSettings-et-sya"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-dtsse-ardoq-adapter"
          ~ name                = "healthProbeSettings-dtsse-ardoq-adapter" -> "healthProbeSettings-sptribs-frontend"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-et-pet"
          ~ name                = "healthProbeSettings-et-pet" -> "healthProbeSettings-dtsse-ardoq-adapter"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-et-staff-pet"
          ~ name                = "healthProbeSettings-et-staff-pet" -> "healthProbeSettings-et-pet"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-et-response-pet"
          ~ name                = "healthProbeSettings-et-response-pet" -> "healthProbeSettings-et-staff-pet"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-tt-pet"
          ~ name                = "healthProbeSettings-tt-pet" -> "healthProbeSettings-et-response-pet"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-hwf-staff-pet"
          ~ name                = "healthProbeSettings-hwf-staff-pet" -> "healthProbeSettings-tt-pet"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-hwf-pet"
          ~ name                = "healthProbeSettings-hwf-pet" -> "healthProbeSettings-hwf-staff-pet"
            # (5 unchanged attributes hidden)
        }
      + backend_pool_health_probe {
          + enabled             = false
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-hwf-pet"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-private-law"
          ~ name                            = "loadBalancingSettings-private-law" -> "loadBalancingSettings-child-adoption"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-et-sya"
          ~ name                            = "loadBalancingSettings-et-sya" -> "loadBalancingSettings-private-law"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-sptribs-frontend"
          ~ name                            = "loadBalancingSettings-sptribs-frontend" -> "loadBalancingSettings-et-sya"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-dtsse-ardoq-adapter"
          ~ name                            = "loadBalancingSettings-dtsse-ardoq-adapter" -> "loadBalancingSettings-sptribs-frontend"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-et-pet"
          ~ name                            = "loadBalancingSettings-et-pet" -> "loadBalancingSettings-dtsse-ardoq-adapter"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-et-staff-pet"
          ~ name                            = "loadBalancingSettings-et-staff-pet" -> "loadBalancingSettings-et-pet"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-et-response-pet"
          ~ name                            = "loadBalancingSettings-et-response-pet" -> "loadBalancingSettings-et-staff-pet"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-tt-pet"
          ~ name                            = "loadBalancingSettings-tt-pet" -> "loadBalancingSettings-et-response-pet"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-hwf-staff-pet"
          ~ name                            = "loadBalancingSettings-hwf-staff-pet" -> "loadBalancingSettings-tt-pet"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-hwf-pet"
          ~ name                            = "loadBalancingSettings-hwf-pet" -> "loadBalancingSettings-hwf-staff-pet"
            # (3 unchanged attributes hidden)
        }
      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-hwf-pet"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      ~ frontend_endpoint {
          ~ host_name                               = "www.apply-to-court-about-child-arrangements-c100.service.gov.uk" -> "www.apply-to-adopt-a-child-placed-in-your-care.service.gov.uk"
            id                                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/private-law"
          ~ name                                    = "private-law" -> "child-adoption"
          ~ web_application_firewall_policy_link_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/privatelawprod" -> "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/childadoptionprod"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "www.claim-employment-tribunals.service.gov.uk" -> "www.apply-to-court-about-child-arrangements-c100.service.gov.uk"
            id                                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/et-sya"
          ~ name                                    = "et-sya" -> "private-law"
          ~ web_application_firewall_policy_link_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/etsyaprod" -> "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/privatelawprod"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "www.special-tribunals.service.gov.uk" -> "www.claim-employment-tribunals.service.gov.uk"
            id                                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/sptribs-frontend"
          ~ name                                    = "sptribs-frontend" -> "et-sya"
          ~ web_application_firewall_polic

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

d-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/jui-redirectHttpsRedirect"
          ~ name               = "jui-redirectHttpsRedirect" -> "fact-redirectHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "jui-redirect",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/idam-web-adminHttpsRedirect"
          ~ name               = "idam-web-adminHttpsRedirect" -> "jui-redirectHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/idam-user-dashboardHttpsRedirect"
          ~ name               = "idam-user-dashboardHttpsRedirect" -> "idam-web-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/hmi-apimHttpsRedirect"
          ~ name               = "hmi-apimHttpsRedirect" -> "idam-user-dashboardHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "reformscan",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/reformscanHttpsRedirect"
          ~ name               = "reformscanHttpsRedirect" -> "hmi-apimHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "adoption",
              + "reformscan",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/adoptionHttpsRedirect"
          ~ name               = "adoptionHttpsRedirect" -> "reformscanHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "private-law",
              + "adoption",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/private-lawHttpsRedirect"
          ~ name               = "private-lawHttpsRedirect" -> "adoptionHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "et-sya",
              + "child-adoption",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/et-syaHttpsRedirect"
          ~ name               = "et-syaHttpsRedirect" -> "child-adoptionHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sptribs-frontend",
              + "private-law",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/sptribs-frontendHttpsRedirect"
          ~ name               = "sptribs-frontendHttpsRedirect" -> "private-lawHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "dtsse-ardoq-adapter",
              + "et-sya",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/dtsse-ardoq-adapterHttpsRedirect"
          ~ name               = "dtsse-ardoq-adapterHttpsRedirect" -> "et-syaHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "et-pet",
              + "sptribs-frontend",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/et-petHttpsRedirect"
          ~ name               = "et-petHttpsRedirect" -> "sptribs-frontendHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "et-staff-pet",
              + "dtsse-ardoq-adapter",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/et-staff-petHttpsRedirect"
          ~ name               = "et-staff-petHttpsRedirect" -> "dtsse-ardoq-adapterHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "et-response-pet",
              + "et-pet",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/et-response-petHttpsRedirect"
          ~ name               = "et-response-petHttpsRedirect" -> "et-petHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "tt-pet",
              + "et-staff-pet",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/tt-petHttpsRedirect"
          ~ name               = "tt-petHttpsRedirect" -> "et-staff-petHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hwf-staff-pet",
              + "et-response-pet",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/hwf-staff-petHttpsRedirect"
          ~ name               = "hwf-staff-petHttpsRedirect" -> "et-response-petHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hwf-pet",
              + "tt-pet",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/hwf-petHttpsRedirect"
          ~ name               = "hwf-petHttpsRedirect" -> "tt-petHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwfees-register",
              + "hwf-staff-pet",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/fees-registerwwwRedirect"
          ~ name               = "fees-registerwwwRedirect" -> "hwf-staff-petHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "fees-register.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwpaybubble",
              + "hwf-pet",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/paybubblewwwRedirect"
          ~ name               = "paybubblewwwRedirect" -> "hwf-petHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "paybubble.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "wwwmanage-payments",
              + "wwwfees-register",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/manage-paymentswwwRedirect"
          ~ name               = "manage-paymentswwwRedirect" -> "fees-registerwwwRedirect"
            # (3 unchanged attributes hidden)

          ~ redirect_configuration {
              ~ custom_host       = "manage-payments.platform.hmcts.net" -> "fees-register.platform.hmcts.net"
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "wwwpayment-outcome",
              + "wwwpaybubble",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/payment-outcomewwwRedirect"
          ~ name               = "payment-outcomewwwRedirect" -> "paybubblewwwRedirect"
            # (3 unchanged attributes hidden)

          ~ redirect_configuration {
              ~ custom_host       = "paymentoutcome-web.platform.hmcts.net" -> "paybubble.platform.hmcts.net"
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "wwwet-pet",
              + "wwwmanage-payments",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/et-petwwwRedirect"
          ~ name               = "et-petwwwRedirect" -> "manage-paymentswwwRedirect"
            # (3 unchanged attributes hidden)

          ~ redirect_configuration {
              ~ custom_host       = "employmenttribunals.service.gov.uk" -> "manage-payments.platform.hmcts.net"
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "response",
              + "wwwpayment-outcome",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/responseredirect"
          ~ name               = "responseredirect" -> "payment-outcomewwwRedirect"
            # (3 unchanged attributes hidden)

          ~ redirect_configuration {
              ~ custom_host       = "incidents.hmcts.net" -> "paymentoutcome-web.platform.hmcts.net"
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sandbox-build",
              + "wwwchild-adoption",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/sandbox-buildredirect"
          ~ name               = "sandbox-buildredirect" -> "child-adoptionwwwRedirect"
            # (3 unchanged attributes hidden)

          ~ redirect_configuration {
              ~ custom_host       = "sandbox-build.hmcts.net" -> "www.apply-to-adopt-a-child-placed-in-your-care.service.gov.uk"
                # (2 unchanged attributes hidden)
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwet-pet",
            ]
          + name               = "et-petwwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "employmenttribunals.service.gov.uk"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "response",
            ]
          + name               = "responseredirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "incidents.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "sandbox-build",
            ]
          + name               = "sandbox-buildredirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "sandbox-build.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "build",
            ]
          + name               = "buildredirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "build.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "static-build",
            ]
          + name               = "static-buildredirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "static-build.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (191 unchanged blocks hidden)
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["build"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/build"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["child-adoption"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/child-adoption"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https["static-build"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/static-build"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https_www_redirect["child-adoption"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https_www_redirect" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/wwwchild-adoption"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1842,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->